{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "embedding_4_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 31], "dtype": "float32", "sparse": false, "name": "embedding_4_input"}, "inbound_nodes": []}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, 31], "dtype": "float32", "input_dim": 10064, "output_dim": 32, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": 0, "maxval": null, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 31}, "inbound_nodes": [[["embedding_4_input", 0, 0, {}]]]}, {"name": "flatten_4", "class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}], "input_layers": [["embedding_4_input", 0, 0]], "output_layers": [["flatten_4", 0, 0]]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}